# Getting started with pandas

In [239]:
from pandas import Series, DataFrame
import pandas as pd

In [240]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

u'/home/jovyan/work'

## Introduction to pandas data structures

### Series

In [49]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
type(obj.values)
#obj.index

numpy.ndarray

In [8]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [5]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [6]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [8]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [11]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [13]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [14]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [15]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [16]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [17]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [18]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [19]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [20]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [21]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [22]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [23]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [24]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [25]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [26]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [27]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [28]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [29]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [30]:
'Ohio' in frame3.columns

True

In [34]:
2002 in frame3.index

True

## Essential functionality

### Reindexing

In [35]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [36]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [37]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [38]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [39]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [40]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [41]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [42]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [47]:
print(frame.ix[['a', 'b', 'c', 'd'], states])
print(frame)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0
   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

### Dropping entries from an axis

In [52]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [53]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [54]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [55]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [59]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [60]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [64]:
obj[1]
type(obj[1:])

pandas.core.series.Series

In [62]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [66]:
obj[['b', 'a', 'd']]

KeyError: ('b', 'a', 'd')

In [67]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [68]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [72]:
obj['b':'c']
obj[1:2]

b    5.0
dtype: float64

In [73]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [74]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [75]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [76]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [77]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [78]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [79]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [80]:
data[data < 5] = 0

In [81]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [83]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [84]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [85]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [86]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [87]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [88]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [89]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [90]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [91]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [92]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [93]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [94]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [95]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [96]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [97]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [98]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [99]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [100]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [101]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [102]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [108]:
series
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [104]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [123]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2
series2

b    0
e    1
f    2
dtype: int64

In [117]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [118]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [125]:
#frame.sub(series3, axis=0)
frame.add(series3, axis=1)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function application and mapping

In [126]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [127]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [128]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [129]:
f = lambda x: x.max() - x.min()

In [132]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [133]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [134]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [135]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [136]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [137]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [138]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [139]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [140]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [141]:
obj = Series([4, 7, -3, 2])
obj.order()

/opt/conda/envs/python2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

2   -3
3    2
0    4
1    7
dtype: int64

In [146]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
#obj.order()
obj.sort_values(axis=0)

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [147]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [149]:
#frame.sort_index(by='b')
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [150]:
frame.sort_index(by=['a', 'b'])

/opt/conda/envs/python2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [157]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [158]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [160]:
obj.rank(ascending=False, method='min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [161]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [162]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [163]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [164]:
obj.index.is_unique

False

In [165]:
obj['a']

a    0
a    1
dtype: int64

In [166]:
obj['c']

4

In [167]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [168]:
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [169]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [170]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [171]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [172]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [173]:
df.idxmax()

one    b
two    d
dtype: object

In [174]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [175]:
df.describe()

/opt/conda/envs/python2/lib/python2.7/site-packages/numpy/lib/function_base.py:3403: RuntimeWarning: Invalid value encountered in median
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [187]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [185]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [189]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-09-13  0.023805 -0.012132 -0.015667 -0.009115
2016-09-14  0.035387  0.003686 -0.011296 -0.004776
2016-09-15  0.033998  0.012158  0.010451  0.016530
2016-09-16 -0.005624 -0.003732 -0.011692  0.001049
2016-09-19 -0.011660 -0.004136  0.006695 -0.005590

In [190]:
returns.MSFT.corr(returns.IBM)

0.50310606453674767

In [191]:
returns.MSFT.cov(returns.IBM)

8.982582210133147e-05

In [192]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.408030  0.387406  0.391280
GOOG  0.408030  1.000000  0.407155  0.466391
IBM   0.387406  0.407155  1.000000  0.503106
MSFT  0.391280  0.466391  0.503106  1.000000

In [193]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000280  0.000109  0.000079  0.000096
GOOG  0.000109  0.000253  0.000079  0.000109
IBM   0.000079  0.000079  0.000147  0.000090
MSFT  0.000096  0.000109  0.000090  0.000216

In [194]:
returns.corrwith(returns.IBM)

AAPL    0.387406
GOOG    0.407155
IBM     1.000000
MSFT    0.503106
dtype: float64

In [195]:
returns.corrwith(volume)

AAPL   -0.076097
GOOG   -0.006051
IBM    -0.203723
MSFT   -0.096681
dtype: float64

### Unique values, value counts, and membership

In [196]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [197]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [198]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [199]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [200]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [201]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [202]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [211]:
result = data.apply(pd.value_counts).fillna(0)
result
#data['Qu1'].value_counts()

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [212]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [213]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [214]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [215]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [216]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [217]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [218]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [219]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [220]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [222]:
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [241]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN       NaN
3  1.246435       NaN -1.296221
4  0.274992       NaN  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [243]:
df.dropna(thresh=2)

          0         1         2
3  1.246435       NaN -1.296221
4  0.274992       NaN  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling in missing data

In [244]:
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.000000
3  1.246435  0.000000 -1.296221
4  0.274992  0.000000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [245]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.204708  0.500000       NaN
1 -0.555730  0.500000       NaN
2  0.092908  0.500000       NaN
3  1.246435  0.500000 -1.296221
4  0.274992  0.500000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [246]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.000000
3  1.246435  0.000000 -1.296221
4  0.274992  0.000000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [247]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [248]:
df.fillna(method='ffill')

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

In [249]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [250]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [251]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.332883
   2   -2.359419
   3   -0.199543
b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
d  2   -0.753887
   3    0.331286
dtype: float64

In [252]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [253]:
data['b']

1   -1.541996
2   -0.970736
3   -1.307030
dtype: float64

In [254]:
data['b':'c']

b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
dtype: float64

In [255]:
data.ix[['b', 'd']]

b  1   -1.541996
   2   -0.970736
   3   -1.307030
d  2   -0.753887
   3    0.331286
dtype: float64

In [256]:
data[:, 2]

a   -2.359419
b   -0.970736
c    0.377984
d   -0.753887
dtype: float64

In [257]:
data.unstack()

          1         2         3
a  0.332883 -2.359419 -0.199543
b -1.541996 -0.970736 -1.307030
c  0.286350  0.377984       NaN
d       NaN -0.753887  0.331286

In [258]:
data.unstack().stack()

a  1    0.332883
   2   -2.359419
   3   -0.199543
b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
d  2   -0.753887
   3    0.331286
dtype: float64

In [259]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [260]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [261]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [262]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [266]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [268]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [269]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [270]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [271]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [272]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [273]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [274]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [275]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [276]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [277]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [278]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [279]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [285]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
t = frame.iloc[0]

0

### Panel data

In [286]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [295]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1711 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2010-01-04 00:00:00 to 2016-09-20 00:00:00
Minor_axis axis: AAPL to MSFT

In [288]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   27.990226  14.06528  313.062468  25.884104
2010-01-05   28.038618  14.38450  311.683844  25.892466
2010-01-06   27.592626  14.10397  303.826685  25.733566
2010-01-07   27.541619  14.23940  296.753749  25.465944
2010-01-08   27.724725  14.36516  300.709808  25.641571
2010-01-11   27.480148  14.37483  300.255255  25.315406
2010-01-12   27.167562  14.56830  294.945572  25.148142
2010-01-13   27.550775  14.57797  293.252243  25.382312
2010-01-14   27.391211  14.22005  294.630868  25.892466
2010-01-15   26.933449  13.92985  289.710772  25.808835
2010-01-19   28.124939  14.32646  293.516976  26.009552
2010-01-20   27.692027  14.03626  289.915587  25.583028
2010-01-21   27.213337  13.92017  291.199286  25.097963
2010-01-22   25.863592  13.18982  274.730736  24.219826
2010-01-25   26.559391  13.43650  269.730740  24.520902
2010-01-26   26.934757  13.13662  270.939526  24.671439
2010-01-27   27.188489  13.08825  270.779695  24.813614
2010-01-28   26.065007  12.84641  266.878565  24.387091
2010-01-29   25.119401  12.47882  264.705742  23.567497
2010-02-01   25.468608  12.78837  266.244198  23.759851
2010-02-02   25.616400  12.86576  265.295156  23.801666
2010-02-03   26.057159  12.92380  270.140309  23.943840
2010-02-04   25.118093  12.58523  263.127321  23.283148
2010-02-05   25.564084  12.80772  265.380075  23.433686
2010-02-08   25.388826  12.95282  266.468996  23.182789
2010-02-09   25.659561  13.10760  267.952522  23.425323
2010-02-10   25.519617  13.30107  266.958496  23.408596
2010-02-11   25.983917  13.49454  267.932539  23.517319
2010-02-12   26.207567  13.38813  266.294170  23.358417
2010-02-16   26.602551  13.67834  270.380071  23.820544
...                ...       ...         ...        ...
2016-08-09  108.809998       NaN  784.260010  57.839507
2016-08-10  108.000000       NaN  784.679993  57.660621
2016-08-11  107.930000       NaN  784.849976  57.938886
2016-08-12  108.180000       NaN  783.219971  57.581115
2016-08-15  109.480003       NaN  782.440002  57.760000
2016-08-16  109.379997       NaN  777.140015  57.439999
2016-08-17  109.220001       NaN  779.909973  57.560001
2016-08-18  109.080002       NaN  777.500000  57.599998
2016-08-19  109.360001       NaN  775.419983  57.619999
2016-08-22  108.510002       NaN  772.150024  57.669998
2016-08-23  108.849998       NaN  772.080017  57.889999
2016-08-24  108.029999       NaN  769.640015  57.950001
2016-08-25  107.570000       NaN  769.409973  58.169998
2016-08-26  106.940002       NaN  769.539978  58.029999
2016-08-29  106.820000       NaN  772.150024  58.099998
2016-08-30  106.000000       NaN  769.090027  57.889999
2016-08-31  106.099998       NaN  767.049988  57.459999
2016-09-01  106.730003       NaN  768.780029  57.590000
2016-09-02  107.730003       NaN  771.460022  57.669998
2016-09-06  107.699997       NaN  780.080017  57.610001
2016-09-07  108.360001       NaN  780.349976  57.660000
2016-09-08  105.519997       NaN  775.320007  57.430000
2016-09-09  103.129997       NaN  759.659973  56.209999
2016-09-12  105.440002       NaN  769.020020  57.049999
2016-09-13  107.949997       NaN  759.690002  56.529999
2016-09-14  111.769997       NaN  762.489990  56.259998
2016-09-15  115.570000       NaN  771.760010  57.189999
2016-09-16  114.919998       NaN  768.880005  57.250000
2016-09-19  113.580002       NaN  765.700012  56.930000
2016-09-20  113.570000       NaN  771.409973  56.810001

[1711 rows x 4 columns]

In [290]:
pdata.ix[:, '6/1/2012', :]
#print(pdata[:3])

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.371509
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.262972

In [291]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   72.845742  14.58765  300.100412  26.426222
2012-05-23   74.623162  12.08221  304.426106  25.849037
2012-05-24   73.937831  12.04351  301.528978  25.813517
2012-05-25   73.541536  12.05319  295.470050  25.804637
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   74.846812  12.24666  296.873645  26.248626
2012-05-30   75.749262  12.14992  293.821674  26.053272
2012-05-31   75.560928  11.92743  290.140354  25.920075
2012-06-01   73.371509  11.67592  285.205295  25.262972
2012-06-04   73.803114  11.60821  289.006480  25.351768
2012-06-05   73.612167  11.76298  284.920579  25.316250
2012-06-06   74.740879  11.81619  289.995487  26.062152
2012-06-07   74.774881  11.73396  288.826666  25.955594
2012-06-08   75.899667  11.72429  289.935570  26.328544
2012-06-11   74.702944  11.47278  283.966519  25.662561
2012-06-12   75.355585  11.57919  282.268201  26.008873
2012-06-13   74.832430  11.87423  280.265216  25.866795
2012-06-14   74.750029  11.93711  279.246220  26.053272
2012-06-15   75.090082  11.89841  281.973510  26.657097
2012-06-18   76.613776  12.01449  285.140358  26.497261
2012-06-19   76.826969  11.78233  290.475012  27.260922
2012-06-20   76.608544  11.89841  288.467038  27.465157
2012-06-21   75.553077  11.60821  282.323161  26.763653
2012-06-22   76.132474  11.80168  285.455033  27.260922
2012-06-25   74.650634  11.55500  280.070407  26.523901
2012-06-26   74.815429  11.53565  282.058429  26.657097
2012-06-27   75.138474  11.92743  284.366112  26.790293
2012-06-28   74.425671  11.55984  281.873596  26.559419
2012-06-29   76.380976  12.10155  289.745749  27.163244
2012-07-02   77.495299  11.98064  289.945546  27.136604
...                ...       ...         ...        ...
2016-08-09  108.809998       NaN  784.260010  57.839507
2016-08-10  108.000000       NaN  784.679993  57.660621
2016-08-11  107.930000       NaN  784.849976  57.938886
2016-08-12  108.180000       NaN  783.219971  57.581115
2016-08-15  109.480003       NaN  782.440002  57.760000
2016-08-16  109.379997       NaN  777.140015  57.439999
2016-08-17  109.220001       NaN  779.909973  57.560001
2016-08-18  109.080002       NaN  777.500000  57.599998
2016-08-19  109.360001       NaN  775.419983  57.619999
2016-08-22  108.510002       NaN  772.150024  57.669998
2016-08-23  108.849998       NaN  772.080017  57.889999
2016-08-24  108.029999       NaN  769.640015  57.950001
2016-08-25  107.570000       NaN  769.409973  58.169998
2016-08-26  106.940002       NaN  769.539978  58.029999
2016-08-29  106.820000       NaN  772.150024  58.099998
2016-08-30  106.000000       NaN  769.090027  57.889999
2016-08-31  106.099998       NaN  767.049988  57.459999
2016-09-01  106.730003       NaN  768.780029  57.590000
2016-09-02  107.730003       NaN  771.460022  57.669998
2016-09-06  107.699997       NaN  780.080017  57.610001
2016-09-07  108.360001       NaN  780.349976  57.660000
2016-09-08  105.519997       NaN  775.320007  57.430000
2016-09-09  103.129997       NaN  759.659973  56.209999
2016-09-12  105.440002       NaN  769.020020  57.049999
2016-09-13  107.949997       NaN  759.690002  56.529999
2016-09-14  111.769997       NaN  762.489990  56.259998
2016-09-15  115.570000       NaN  771.760010  57.189999
2016-09-16  114.919998       NaN  768.880005  57.250000
2016-09-19  113.580002       NaN  765.700012  56.930000
2016-09-20  113.570000       NaN  771.409973  56.810001

[1104 rows x 4 columns]

In [292]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2016-09-07 AAPL   107.830002  108.760002  107.070000  108.360001   42364300.0
           GOOG   780.000000  782.729980  776.200012  780.349976     893700.0
           MSFT    57.470001   57.840000   57.410000   57.660000   17493400.0
2016-09-08 AAPL   107.250000  107.269997  105.239998  105.519997   53002000.0
           GOOG   778.590027  780.349976  773.580017  775.320007    1260600.0
           MSFT    57.630001   57.790001   57.180000   57.430000   20146100.0
2016-09-09 AAPL   104.639999  105.720001  103.129997  103.129997   46557000.0
           GOOG   770.099976  773.244995  759.659973  759.659973    1812200.0
           MSFT    56.790001   57.520000   56.209999   56.209999   35113900.0
2016-09-12 AAPL   102.650002  105.720001  102.529999  105.440002   45292800.0
           GOOG   755.130005  770.289978  754.000000  769.020020    1286800.0
           MSFT    56.000000   57.209999   55.610001   57.049999   29303000.0
2016-09-13 AAPL   107.510002  108.790001  107.239998  107.949997   62176200.0
           GOOG   764.479980  766.219971  755.799988  759.690002    1379900.0
           MSFT    56.500000   56.650002   56.049999   56.529999   30130200.0
2016-09-14 AAPL   108.730003  113.029999  108.599998  111.769997  110888700.0
           GOOG   759.609985  767.679993  759.109985  762.489990    1087400.0
           MSFT    56.389999   56.630001   56.029999   56.259998   24062500.0
2016-09-15 AAPL   113.860001  115.730003  113.489998  115.570000   89983600.0
           GOOG   762.890015  773.799988  759.960022  771.760010    1305100.0
           MSFT    56.150002   57.349998   55.980000   57.189999   26847000.0
2016-09-16 AAPL   115.120003  116.129997  114.040001  114.919998   79886900.0
           GOOG   769.750000  769.750000  764.659973  768.880005    2046000.0
           MSFT    57.630001   57.630001   56.750000   57.250000   44607000.0
2016-09-19 AAPL   115.190002  116.180000  113.250000  113.580002   47023000.0
           GOOG   772.419983  774.000000  764.440979  765.700012    1171100.0
           MSFT    57.270000   57.750000   56.849998   56.930000   20937100.0
2016-09-20 AAPL   113.050003  114.120003  112.510002  113.570000   34437000.0
           GOOG   769.000000  773.330017  768.530029  771.409973     975300.0
           MSFT    57.349998   57.349998   56.750000   56.810001   16931800.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.749262
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.053272
2012-05-31 AAPL    75.560928
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.920075
2012-06-01 AAPL    73.371509
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.262972
2012-06-04 AAPL    73.803114
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.351768
2012-06-05 AAPL    73.612167
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.316250
2012-06-06 AAPL    74.740879
           DELL    11.816190
           GOOG   289.995487
           MSFT    26.062152
2012-06-07 AAPL    74.774881
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.955594
2012-06-08 AAPL    75.899667
           DELL    11.724290
...                      ...
2016-09-07 AAPL   108.360001
           GOOG   780.349976
           MSFT    57.660000
2016-09-08 AAPL   105.519997
           GOOG   775.320007
           MSFT    57.430000
2016-09-09 AAPL   103.129997
           GOOG   759.659973
           MSFT    56.209999
2016-09-12 AAPL   105.440002
           GOOG   769.020020
           MSFT    57.049999
2016-09-13 AAPL   107.949997
           GOOG   759.690002
           MSFT    56.529999
2016-09-14 AAPL   111.769997
           GOOG   762.489990
           MSFT    56.259998
2016-09-15 AAPL   115.570000
           GOOG   771.760010
           MSFT    57.189999
2016-09-16 AAPL   114.919998
           GOOG   768.880005
           MSFT    57.250000
2016-09-19 AAPL   113.580002
           GOOG   765.700012
           MSFT    56.930000
2016-09-20 AAPL   113.570000
           GOOG   771.409973
           MSFT    56.810001

[3625 rows x 6 columns]

In [293]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1098 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2016-09-20 00:00:00
Minor_axis axis: AAPL to MSFT